backend/app/controllers/api/investors_controller.rb

SELECT `investors`.* FROM `investors`
---
    def index
      investors = Investor.all

INSERT INTO `investors` (`first_name`, `last_name`, `date_of_birth`, `phone_number`, `street_address`, `state`, `zip_code`, `created_at`, `updated_at`) VALUES ('bob', 'thing', '2025-02-25', '2343', '43225', 'CA', '43353', '2025-05-11 20:34:56.743347', '2025-05-11 20:34:56.743347')
---
    def create
      investor = Investor.new(investor_params)
      if investor.save

SELECT `investors`.* FROM `investors` WHERE `investors`.`id` = 1 LIMIT 1
---
    def set_investor
      @investor = Investor.find(params[:id])